app/controllers/api/v1/posts_controller.rb

  def index
    if params[:user_id]
      user = User.find_by(id: params[:user_id])

      if user
        posts = Post.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts"

  def create
    user = User.find_by(id: params[:user_id])

    if user
      post = user.posts.build(post_params)

      if post.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My Post"], ["content", "This is the content of my post."], ["user_id", 5], ["created_at", "2023-08-24 14:36:58.938625"], ["updated_at", "2023-08-24 14:36:58.938625"]]