app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "yuvi@example.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "last_login_at" = ? WHERE "users"."id" = ?  [["updated_at", "2023-08-24 14:08:10.339648"], ["last_login_at", "2023-08-24 14:08:10.339299"], ["id", 4]]
---
  def create
    user = User.find_by(email: params[:email])
    user.update(last_login_at: Time.now)

SELECT "users".* FROM "users" WHERE (last_login_at >= '2023-07-25 14:04:56.454766')
---
  def all_users
    all_users = User.all