app/controllers/api/v1/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "yuvi"], ["email", "yuvi@example.com"], ["password", "[FILTERED]"], ["created_at", "2023-08-24 12:18:09.832280"], ["updated_at", "2023-08-24 12:18:09.832280"]]